# ExternallyTaggedGeometryValidation Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternallyTaggedGeometryValidation Class
Members See Also
---
Provides validation for geometry to be stored in an ExternallyTaggedGeometry.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public static class ExternallyTaggedGeometryValidation
```

Visual Basic
---
```text
Public NotInheritable Class ExternallyTaggedGeometryValidation
```

Visual C++
---
```text
public ref class ExternallyTaggedGeometryValidation abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..ExternallyTaggedGeometryValidation
# See Also
ExternallyTaggedGeometryValidation Members
Autodesk.Revit.DB Namespace